### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [8]:
# Dependencies and Setup
import pandas as pd
import numpy as np
# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [9]:
# View purchase data
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
purchase_data[["SN","Gender", "Item ID"]].head()

              SN Gender  Item ID
0        Lisim78   Male      108
1    Lisovynya38   Male      143
2     Ithergue48   Male       92
3  Chamassasya86   Male      100
4      Iskosia90   Male      131

* Display the total number of players

In [4]:
# Counts unique counts using SN
purchase_data.SN.value_counts()

Lisosia93       5
Idastidru52     4
Iral74          4
Phaena87        3
Hada39          3
               ..
Lisilsa62       1
Sundim98        1
Saerallora71    1
Pheodai94       1
Undimsya85      1
Name: SN, Length: 576, dtype: int64

In [5]:
# Variable to make manipulation easier
player_demographics = purchase_data.loc[:, ["Gender", "SN", "Age"]]

player_demographics = player_demographics.drop_duplicates()
player_demographics

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
773    Male         Hala31   21
774    Male     Jiskjask80   11
775  Female     Aethedru70   21
777    Male     Yathecal72   20
778    Male        Sisur91    7

[576 rows x 3 columns]

In [6]:
number_of_players = player_demographics.count()[0]
#print(f'total number of players is {number_of_players}')  
number_of_players#.dtype

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
# Calculate average price
price_info = purchase_data["Price"]
average_price = np.average(price_info)
average_price#.dtype

#print(f'Average price of items: {average_price}')

3.0509871794871795

In [8]:
# Obtaining number of unique items
# Create list of values
unique_items_list = purchase_data["Item ID"].unique()
unique_items_list
# Count the objects in the list 
unique_items = len(unique_items_list)
unique_items#.dtype

183

In [9]:
# Creating dictionary for data to be included in data frame
gaming_dict = [{"Total Number of Players": [number_of_players]},
               {"Number of Unique Items": [unique_items]}]
gaming_dict
# Creating summary data frame
summary_df = pd.DataFrame(gaming_dict)
summary_df.head()

  Total Number of Players Number of Unique Items
0                   [576]                    NaN
1                     NaN                  [183]

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [11]:
# Narrow to only gender and SN *WHILE INCLUDING NUMBER OF REPEAT CUSTOMERS
player_gender = purchase_data["Gender"]

# Summary of gender demographics 
player_gender.value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [11]:
# using .describe() to give summary of gender data
player_gender.describe()

count      780
unique       3
top       Male
freq       652
Name: Gender, dtype: object

In [12]:
# Percentage of players by gender
male = player_gender.value_counts("Male") *100
male # Convert male(float) to int for percent sign

Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [13]:
# Finding avg. purchase price by gender
avg_gender_price = purchase_data.groupby(["Gender"]).mean()

avg_gender_price

                       Purchase ID        Age    Item ID     Price
Gender
Female                  379.380531  21.345133  85.477876  3.203009
Male                    392.516871  22.917178  93.524540  3.017853
Other / Non-Disclosed   334.600000  24.200000  80.800000  3.346000

In [14]:
# Finding avg. total purchase price by gender- MUST REVISE; NOT SURE OF ACCURACY
tot_gender_price = purchase_data.groupby(["Gender"]).sum()/player_gender.count()
tot_gender_price

                       Purchase ID        Age    Item ID     Price
Gender
Female                   54.961538   3.092308  12.383333  0.464026
Male                    328.103846  19.156410  78.176923  2.522615
Other / Non-Disclosed     6.434615   0.465385   1.553846  0.064346

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [15]:
# Determine Age
determine_age = purchase_data["Age"]
determine_age.value_counts()

# Use oldest and youngest to determine bin range
#oldest = purchase_data["Age"].max()
#oldest

#youngest = purchase_data["Age"].min()
#youngest

20    99
22    70
24    67
23    67
21    62
25    59
15    35
30    35
16    30
18    26
19    23
17    22
35    14
33    14
26    14
29    13
27    10
10     9
7      9
34     9
38     9
32     8
8      8
11     7
31     7
37     7
39     6
40     6
9      6
12     6
36     5
28     5
13     4
44     2
41     2
14     2
43     1
42     1
45     1
Name: Age, dtype: int64

## Purchasing Analysis (Age)

In [16]:
# Create age bins
bins = [0, 10, 20, 30, 40, 50]

# Create labels for bins
group_labels = ["0 to 10", "11 to 20", "21 to 30", "31 to 40", "41 to 50"]

In [17]:
# Placing Age into the bins
pd.cut(purchase_data["Age"], bins, labels=group_labels).head()
purchase_data["Age"].head()

0    20
1    40
2    24
3    24
4    23
Name: Age, dtype: int64

In [18]:
# Placing the added Age bins into our overall df using new column "Age Groups"
purchase_data["Age Groups"] = pd.cut(purchase_data["Age"], bins, labels=group_labels)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Groups
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,11 to 20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,31 to 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,21 to 30
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,21 to 30
4,4,Iskosia90,23,Male,131,Fury,1.44,21 to 30

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [19]:
# Creating groupby object based on "Age Groups"
gaming_group = purchase_data.groupby("Age Groups")

# Finding the number of rows fall into each bin
purchase_count = gaming_group["Price"].count()
purchase_count

Age Groups
0 to 10      32
11 to 20    254
21 to 30    402
31 to 40     85
41 to 50      7
Name: Price, dtype: int64

In [20]:
# Running basic calculations: purchase count, avg. purchase price, avg purchase total
# average purchase price per age group
gaming_group[["Price"]].mean()

               Price
Age Groups
0 to 10     3.405000
11 to 20    3.063622
21 to 30    2.992687
31 to 40    3.153647
41 to 50    3.075714

In [23]:
# Average purchase total - MUST FIND TOTAL NUMBER OF PLAYERS IN EACH CATEGORY
gaming_group[["Price"]].sum()/purchase_count

            0 to 10  11 to 20  21 to 30  31 to 40  41 to 50  Price
Age Groups
0 to 10         NaN       NaN       NaN       NaN       NaN    NaN
11 to 20        NaN       NaN       NaN       NaN       NaN    NaN
21 to 30        NaN       NaN       NaN       NaN       NaN    NaN
31 to 40        NaN       NaN       NaN       NaN       NaN    NaN
41 to 50        NaN       NaN       NaN       NaN       NaN    NaN

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [24]:
# retrieving item id, item name, and item price columns
pop_items = purchase_data[["Item ID", "Item Name", "Price"]]
pop_items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [25]:
# grouping data by item id and name
item_group = pop_items.groupby(("Item ID", "Item Name"))
item_group.head()

C:\Users\bocli\New_Anaconda\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Interpreting tuple 'by' as a list of keys, rather than a single key. Use 'by=[...]' instead of 'by=(...)'. In the future, a tuple will always mean a single key.

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
766       58          Freak's Bite, Favor of Holy Might   4.14
774      101                               Final Critic   4.19
777       67      Celeste, Incarnation of the Corrupted   3.46
778      101                               Final Critic   4.19
779       50                                       Dawn   4.60

[697 rows x 3 columns]

In [26]:
# Calculating purchase count and price information using .describe()
item_purchase_count = item_group.count()
item_purchase_count.describe()

# min price is $1.00
# max price is $12.00
# total number of items bought : 183 items

            Price
count  183.000000
mean     4.262295
std      1.954721
min      1.000000
25%      3.000000
50%      4.000000
75%      5.000000
max     12.000000

In [ ]:
#item_purchase_count.min()
#item_purchase_count.max()
#item_purchase_count.sum()

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [ ]:
item_group.sort()